import type { IInfo } from "@/api/items.types";
import { PopupTypes } from "@/api/items.types";

const info: IInfo[] = [
  {
    title: "2013 — 2016",
    subtitle: "Системная работа и работа со сложными случаями и категориями подопечных",
    text: "<p>Волонтеры работают с выпускниками детских домов для детей с инвалидностью - молодыми людьми в ПНИ.</p><p>Открылась Школа приемных родителей и специальные модули, чтобы родители лучше понимали проблемы подростков, детей с ОВЗ. Мы впервые ищем семьи для временного размещения детей. Разработаны поправки в законодательство, чтобы не разделяли братьев и сестер и не переводили детей из одного учреждения в другое.</p>",
    items: [
      {
        year: 2013,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2013,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
      {
        year: 2013,
        popup: {
          type: PopupTypes.Statistic,
          items: [
            { title: "1910", text: "звонков на телефон фонда" },
            { title: "686", text: "заполненных волонтерских анкет" },
            { title: "483", text: "волонтера прошли первичное обучение" },
            { title: "125", text: "детей получили помощь в лечении и реабилитации" },
            { title: "98", text: "детей получили помощь в лечении и реабилитации" },
            {
              title: "11",
              text: "городов, в которых проводился мониторинг интернатных учреждений и кризисных центров",
            },
            {
              title: "917",
              text: "специалистов защиты детства и сотрудников сиротских учреждений, посетивших семинары",
            },
          ],
        },
      },
      {
        year: 2014,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2015,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
      {
        year: 2015,
        popup: {
          type: PopupTypes.Statistic,
          items: [
            { title: "1910", text: "звонков на телефон фонда" },
            { title: "686", text: "заполненных волонтерских анкет" },
            { title: "483", text: "волонтера прошли первичное обучение" },
            { title: "125", text: "детей получили помощь в лечении и реабилитации" },
            { title: "98", text: "детей получили помощь в лечении и реабилитации" },
            {
              title: "11",
              text: "городов, в которых проводился мониторинг интернатных учреждений и кризисных центров",
            },
            {
              title: "917",
              text: "специалистов защиты детства и сотрудников сиротских учреждений, посетивших семинары",
            },
          ],
        },
      },
      {
        year: 2016,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2016,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
    ],
  },
  {
    title: "2017 — 2020",
    subtitle: "Системная работа и работа со сложными случаями и категориями подопечных",
    text: "<p>Волонтеры работают с выпускниками детских домов для детей с инвалидностью - молодыми людьми в ПНИ.</p><p>Открылась Школа приемных родителей и специальные модули, чтобы родители лучше понимали проблемы подростков, детей с ОВЗ. Мы впервые ищем семьи для временного размещения детей. Разработаны поправки в законодательство, чтобы не разделяли братьев и сестер и не переводили детей из одного учреждения в другое.</p>",
    items: [
      {
        year: 2017,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2017,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
      {
        year: 2017,
        popup: {
          type: PopupTypes.Statistic,
          items: [
            { title: "1910", text: "звонков на телефон фонда" },
            { title: "686", text: "заполненных волонтерских анкет" },
            { title: "483", text: "волонтера прошли первичное обучение" },
            { title: "125", text: "детей получили помощь в лечении и реабилитации" },
            { title: "98", text: "детей получили помощь в лечении и реабилитации" },
            {
              title: "11",
              text: "городов, в которых проводился мониторинг интернатных учреждений и кризисных центров",
            },
            {
              title: "917",
              text: "специалистов защиты детства и сотрудников сиротских учреждений, посетивших семинары",
            },
          ],
        },
      },
      {
        year: 2018,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2018,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
      {
        year: 2019,
        popup: {
          type: PopupTypes.Statistic,
          items: [
            { title: "1910", text: "звонков на телефон фонда" },
            { title: "686", text: "заполненных волонтерских анкет" },
            { title: "483", text: "волонтера прошли первичное обучение" },
            { title: "125", text: "детей получили помощь в лечении и реабилитации" },
            { title: "98", text: "детей получили помощь в лечении и реабилитации" },
            {
              title: "11",
              text: "городов, в которых проводился мониторинг интернатных учреждений и кризисных центров",
            },
            {
              title: "917",
              text: "специалистов защиты детства и сотрудников сиротских учреждений, посетивших семинары",
            },
          ],
        },
      },
      {
        year: 2020,
        text: "<p>Удалось перезапустить сайт, который в почти неизменном виде существовал с 2006 года.</p>",
      },
      {
        year: 2020,
        popup: {
          type: PopupTypes.Story,
          title: "История Кости",
          text: "<p>Косте 11 лет, он живет в приемной семье. Взяли его полуторагодовалым ребенком, который плохо ходил и почти не говорил, тревожно спал и иногда был агрессивен. Помимо Кости в семье есть еще 4 младших детей. Родители очень много занимались Костиным развитием, он ходил на занятия по футболу, верховой езде, посещал психолога, но к 10 годам ситуация усложнилась: его начали мучить страхи, наружу стали прорываться злость и гнев. Сейчас одиннадцатилетний Костя контролирует эмоции почти как трехлетний ребенок и справиться с их бурным проявлением не в силах. Семья Кости попросила помочь с оплатой занятий поведенческой терапии, где Костю учили отрабатывать различные непростые эмоциональные ситуации на школьной продленке (он никак не мог ужиться с одноклассниками). В результате Костя стал спокойнее вести себя в школе, смог адаптироваться в летнем лагере и вести себя как все его ровесники, с удовольствием начал учиться играть на гитаре. Костя получил в подарок футбольный мяч лично от тренера за спокойствие, проявляемое на поле.</p>",
          image: "https://via.placeholder.com/288x180",
        },
      },
    ],
  },
];

export default info;
